userbogd/WebguiappTemplate/sdkconfig.defaults.esp32c6
CONFIG_VFS_INITIALIZE_DEV_NULL=y
# end of Virtual file system

#
# Wear Levelling
#
# CONFIG_WL_SECTOR_SIZE_512 is not set
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# Wi-Fi Provisioning Manager
#
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16
CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=30
CONFIG_WIFI_PROV_STA_ALL_CHANNEL_SCAN=y
# CONFIG_WIFI_PROV_STA_FAST_SCAN is not set
# end of Wi-Fi Provisioning Manager

#
# WebGUIApp
#
CONFIG_BOARD_HARDWARE_REVISION=1
CONFIG_BOARD_HARDWARE_OPTION="DEFAULT"
CONFIG_DEVICE_MODEL_NAME="WEBGUIAPP"
CONFIG_WEBGUIAPP_HOSTNAME="WEBGUIAPP"
CONFIG_WEBGUIAPP_USERNAME="user"
CONFIG_WEBGUIAPP_USERPASS="password"
CONFIG_MAIN_FUNCTIONAL_BUTTON_GPIO=15
CONFIG_DEBUG_MODE_ENABLE=y
# CONFIG_RESET_MODE_ENABLE is not set

#
# Web UI settings
#
CONFIG_WEBGUIAPP_DEFAULT_COLOR_SCHEME=1
CONFIG_WEBGUIAPP_ACCENT_COLOR="#dba617"
# end of Web UI settings

#
# OTA settings
#
# CONFIG_WEBGUIAPP_OTA_AUTOUPDATE_ENABLE is not set
# CONFIG_WEBGUIAPP_OTA_RESET_ENABLE is not set
CONFIG_WEBGUIAPP_OTA_HOST="https://openergy.ru/firmware/firmware.bin"
CONFIG_WEBGUIAPP_OTA_AUTOUPDATE_PERIOD=3600
# end of OTA settings

#
# SNTP client settings
#
CONFIG_WEBGUIAPP_SNTP_AUTOUPDATE_ENABLE=y
CONFIG_WEBGUIAPP_SNTP_HOST_1="1.pool.ntp.org"
CONFIG_WEBGUIAPP_SNTP_HOST_2="2.pool.ntp.org"
CONFIG_WEBGUIAPP_SNTP_HOST_3="3.pool.ntp.org"
CONFIG_WEBGUIAPP_SNTP_AUTOUPDATE_PERIOD=3600
CONFIG_WEBGUIAPP_SNTP_TIMEZONE=2
# end of SNTP client settings

#
# Command Processor settings
#
CONFIG_WEBGUIAPP_MAX_OBJECTS_NUM=8
CONFIG_WEBGUIAPP_MAX_COMMANDS_NUM=8
CONFIG_WEBGUIAPP_MAX_COMMAND_STRING_LENGTH=64
# end of Command Processor settings

#
# CRON settings
#
CONFIG_WEBGUIAPP_CRON_ENABLE=y
CONFIG_WEBGUIAPP_CRON_NUMBER=16
# end of CRON settings

#
# SPI settings
#
# CONFIG_WEBGUIAPP_SPI_ENABLE is not set
# end of SPI settings

#
# I2C settings
#
# CONFIG_WEBGUIAPP_I2C_ENABLE is not set
# end of I2C settings

#
# SDCARD settings
#
# CONFIG_SDCARD_ENABLE is not set
# end of SDCARD settings

#
# WiFi settings
#
CONFIG_WEBGUIAPP_WIFI_ENABLE=y
CONFIG_WEBGUIAPP_WIFI_ON=y
CONFIG_WEBGUIAPP_WIFI_DHCP_ON=y
CONFIG_WEBGUIAPP_WIFI_SSID_AP="WEBGUIAPP"
CONFIG_WEBGUIAPP_WIFI_KEY_AP="123456789"
CONFIG_WEBGUIAPP_WIFI_SSID_STA="YourSTA"
CONFIG_WEBGUIAPP_WIFI_KEY_STA="123456789"
CONFIG_WEBGUIAPP_WIFI_IP_AP="192.168.150.1"
CONFIG_WEBGUIAPP_WIFI_IP_STA="192.168.150.1"
CONFIG_WEBGUIAPP_WIFI_MASK_STA="255.255.255.0"
CONFIG_WEBGUIAPP_WIFI_GATEWAY_STA="192.168.150.1"
# end of WiFi settings

#
# Ethernet settings
#
# CONFIG_WEBGUIAPP_ETHERNET_ENABLE is not set
# end of Ethernet settings

#
# GPRS settings
#
# CONFIG_WEBGUIAPP_GPRS_ENABLE is not set
# end of GPRS settings

#
# LoRaWAN settings
#
# CONFIG_WEBGUIAPP_LORAWAN_ENABLE is not set
# end of LoRaWAN settings

#
# PPPoS configuration
#
# CONFIG_WEBGUIAPP_PPPOS_ENABLE is not set
# end of PPPoS configuration

#
# SR IO extender configuration
#
# CONFIG_WEBGUIAPP_SR_ENABLE is not set
CONFIG_WEBGUIAPP_SR_CLOCK_MHZ=1
CONFIG_WEBGUIAPP_SR_CS=12
CONFIG_WEBGUIAPP_SR_OUTPUTS=8
CONFIG_WEBGUIAPP_SR_INPUTS=8
# end of SR IO extender configuration

#
# Serial port configuration
#
# CONFIG_WEBGUIAPP_UART_TRANSPORT_ENABLE is not set
# end of Serial port configuration

#
# Modbus settings
#
# CONFIG_WEBGUIAPP_MBTCP_ENABLED is not set
# end of Modbus settings

#
# Modbus settings
#
# CONFIG_WEBGUIAPP_ARTNET_ENABLED is not set
CONFIG_WEBGUIAPP_ARTNET_DEFAULT_UNIVERSE=1
CONFIG_WEBGUIAPP_ARTNET_DEFAULT_BASEADDR=1
CONFIG_WEBGUIAPP_ARTNET_DEFAULT_PORT=6454
# end of Modbus settings

#
# MQTT settings
#
CONFIG_WEBGUIAPP_MQTT_ENABLE=y
CONFIG_WEBGUIAPP_MQTT_CLIENTS_NUM=2
# CONFIG_WEBGUIAPP_MQTT_ON is not set
CONFIG_WEBGUIAPP_MQTT_MAX_TOPIC_LENGTH=128
CONFIG_WEBGUIAPP_MQTT_SERVER_URL="mqttbroker.com"
CONFIG_WEBGUIAPP_MQTT_SERVER_PORT=1883
CONFIG_WEBGUIAPP_MQTT_CLIENT_ID_1="DEV1"
CONFIG_WEBGUIAPP_MQTT_CLIENT_ID_2="DEV2"
CONFIG_WEBGUIAPP_MQTT_SYSTEM_NAME="SYSTEMNAME"
CONFIG_WEBGUIAPP_MQTT_GROUP_NAME="GROUPNAME"
CONFIG_WEBGUIAPP_MQTT_USERNAME="username"
CONFIG_WEBGUIAPP_MQTT_PASSWORD="password"
CONFIG_WEBGUIAPP_MQTT_HEARTBEAT_ON=y
CONFIG_WEBGUIAPP_MQTT_HEARTBEAT_INTERVAL=300
CONFIG_WEBGUIAPP_MQTT_DEBUG_LEVEL=1
# end of MQTT settings

#
# System log
#
CONFIG_WEBGUIAPP_SYSLOG_MAX_CHUNKS=4
CONFIG_WEBGUIAPP_SYSLOG_CHUNK_SIZE=50
# end of System log

#
# DNS settings
#
CONFIG_WEBGUIAPP_DNS1_ADDRESS_DEFAULT="8.8.8.8"
CONFIG_WEBGUIAPP_DNS2_ADDRESS_DEFAULT="8.8.4.4"
CONFIG_WEBGUIAPP_DNS3_ADDRESS_DEFAULT="1.1.1.1"
# end of DNS settings

#
# libespfs
#
# CONFIG_ESPFS_LOG_LEVEL_NONE is not set
# CONFIG_ESPFS_LOG_LEVEL_ERROR is not set
CONFIG_ESPFS_LOG_LEVEL_WARNING=y
# CONFIG_ESPFS_LOG_LEVEL_INFO is not set
# CONFIG_ESPFS_LOG_LEVEL_DEBUG is not set
# CONFIG_ESPFS_LOG_LEVEL_VERBOSE is not set
CONFIG_ESPFS_MAX_PARTITIONS=1
CONFIG_ESPFS_USE_HEATSHRINK=y
# end of libespfs
# end of WebGUIApp

#
# esp-modem
#
CONFIG_ESP_MODEM_CMUX_DEFRAGMENT_PAYLOAD=y
# CONFIG_ESP_MODEM_USE_INFLATABLE_BUFFER_IF_NEEDED is not set
CONFIG_ESP_MODEM_CMUX_DELAY_AFTER_DLCI_SETUP=0
# CONFIG_ESP_MODEM_CMUX_USE_SHORT_PAYLOADS_ONLY is not set
# CONFIG_ESP_MODEM_ADD_CUSTOM_MODULE is not set
CONFIG_ESP_MODEM_C_API_STR_MAX=128
# CONFIG_ESP_MODEM_URC_HANDLER is not set
# CONFIG_ESP_MODEM_PPP_ESCAPE_BEFORE_EXIT is not set
# CONFIG_ESP_MODEM_ADD_DEBUG_LOGS is not set
# end of esp-modem

#
# mDNS
#
CONFIG_MDNS_MAX_INTERFACES=3
CONFIG_MDNS_MAX_SERVICES=10
CONFIG_MDNS_TASK_PRIORITY=1
CONFIG_MDNS_ACTION_QUEUE_LEN=16
CONFIG_MDNS_TASK_STACK_SIZE=4096
# CONFIG_MDNS_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_MDNS_TASK_AFFINITY_CPU0=y
CONFIG_MDNS_TASK_AFFINITY=0x0

#
# MDNS Memory Configuration
#
CONFIG_MDNS_TASK_CREATE_FROM_INTERNAL=y
CONFIG_MDNS_MEMORY_ALLOC_INTERNAL=y
# CONFIG_MDNS_MEMORY_CUSTOM_IMPL is not set
# end of MDNS Memory Configuration

CONFIG_MDNS_SERVICE_ADD_TIMEOUT_MS=2000
CONFIG_MDNS_TIMER_PERIOD_MS=100
# CONFIG_MDNS_NETWORKING_SOCKET is not set
# CONFIG_MDNS_SKIP_SUPPRESSING_OWN_QUERIES is not set
# CONFIG_MDNS_ENABLE_DEBUG_PRINTS is not set
CONFIG_MDNS_ENABLE_CONSOLE_CLI=y
# CONFIG_MDNS_RESPOND_REVERSE_QUERIES is not set
CONFIG_MDNS_MULTIPLE_INSTANCE=y

#
# MDNS Predefined interfaces
#
CONFIG_MDNS_PREDEF_NETIF_STA=y
CONFIG_MDNS_PREDEF_NETIF_AP=y
CONFIG_MDNS_PREDEF_NETIF_ETH=y
# end of MDNS Predefined interfaces
# end of mDNS

#
# The Things Network
#
# CONFIG_TTN_LORA_FREQ_DISABLED is not set
# CONFIG_TTN_LORA_FREQ_EU_868 is not set
# CONFIG_TTN_LORA_FREQ_US_915 is not set
# CONFIG_TTN_LORA_FREQ_AU_915 is not set
# CONFIG_TTN_LORA_FREQ_AS_923 is not set
# CONFIG_TTN_LORA_FREQ_AS_923_JP is not set
# CONFIG_TTN_LORA_FREQ_KR_920 is not set
# CONFIG_TTN_LORA_FREQ_IN_866 is not set
CONFIG_TTN_LORA_FREQ_RU_864=y
# CONFIG_TTN_RADIO_SX1272_73 is not set
CONFIG_TTN_RADIO_SX1276_77_78_79=y
CONFIG_TTN_SPI_FREQ=10000000
CONFIG_TTN_RESET_STATES_FLOATING=y
# CONFIG_TTN_RESET_STATES_ASSERTED is not set
CONFIG_TTN_BG_TASK_PRIO=10
# CONFIG_TTN_PROVISION_UART_DEFAULT is not set
# CONFIG_TTN_PROVISION_UART_CUSTOM is not set
CONFIG_TTN_PROVISION_UART_NONE=y
CONFIG_TTN_PROVISION_UART_NUM=0
# end of The Things Network
# end of Component config

# CONFIG_IDF_EXPERIMENTAL_FEATURES is not set

# Deprecated options for backward compatibility
# CONFIG_APP_BUILD_TYPE_ELF_RAM is not set
# CONFIG_NO_BLOBS is not set
# CONFIG_APP_ROLLBACK_ENABLE is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_NONE is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_ERROR is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_WARN is not set
CONFIG_LOG_BOOTLOADER_LEVEL_INFO=y
# CONFIG_LOG_BOOTLOADER_LEVEL_DEBUG is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_VERBOSE is not set
CONFIG_LOG_BOOTLOADER_LEVEL=3
# CONFIG_FLASH_ENCRYPTION_ENABLED is not set
# CONFIG_FLASHMODE_QIO is not set
# CONFIG_FLASHMODE_QOUT is not set
CONFIG_FLASHMODE_DIO=y
# CONFIG_FLASHMODE_DOUT is not set
CONFIG_MONITOR_BAUD=115200
CONFIG_OPTIMIZATION_LEVEL_DEBUG=y
CONFIG_COMPILER_OPTIMIZATION_LEVEL_DEBUG=y
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
# CONFIG_OPTIMIZATION_LEVEL_RELEASE is not set
# CONFIG_COMPILER_OPTIMIZATION_LEVEL_RELEASE is not set
CONFIG_OPTIMIZATION_ASSERTIONS_ENABLED=y
# CONFIG_OPTIMIZATION_ASSERTIONS_SILENT is not set
# CONFIG_OPTIMIZATION_ASSERTIONS_DISABLED is not set
CONFIG_OPTIMIZATION_ASSERTION_LEVEL=2
# CONFIG_CXX_EXCEPTIONS is not set
CONFIG_STACK_CHECK_NONE=y
# CONFIG_STACK_CHECK_NORM is not set
# CONFIG_STACK_CHECK_STRONG is not set
# CONFIG_STACK_CHECK_ALL is not set
# CONFIG_WARN_WRITE_STRINGS is not set
# CONFIG_ESP32_APPTRACE_DEST_TRAX is not set
CONFIG_ESP32_APPTRACE_DEST_NONE=y
CONFIG_ESP32_APPTRACE_LOCK_ENABLE=y
CONFIG_SW_COEXIST_ENABLE=y
CONFIG_ESP32_WIFI_SW_COEXIST_ENABLE=y
CONFIG_ESP_WIFI_SW_COEXIST_ENABLE=y
# CONFIG_EXTERNAL_COEX_ENABLE is not set
# CONFIG_ESP_WIFI_EXTERNAL_COEXIST_ENABLE is not set
# CONFIG_GPTIMER_ISR_IRAM_SAFE is not set
# CONFIG_MCPWM_ISR_IRAM_SAFE is not set
# CONFIG_EVENT_LOOP_PROFILING is not set
CONFIG_POST_EVENTS_FROM_ISR=y
CONFIG_POST_EVENTS_FROM_IRAM_ISR=y
CONFIG_GDBSTUB_SUPPORT_TASKS=y
CONFIG_GDBSTUB_MAX_TASKS=32
# CONFIG_OTA_ALLOW_HTTP is not set
# CONFIG_ESP_SYSTEM_PD_FLASH is not set
CONFIG_PERIPH_CTRL_FUNC_IN_IRAM=y
CONFIG_BROWNOUT_DET=y
CONFIG_BROWNOUT_DET_LVL_SEL_7=y
# CONFIG_BROWNOUT_DET_LVL_SEL_6 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_5 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_4 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_3 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_2 is not set
CONFIG_BROWNOUT_DET_LVL=7
CONFIG_ESP_SYSTEM_BROWNOUT_INTR=y
CONFIG_ESP32_PHY_CALIBRATION_AND_DATA_STORAGE=y
# CONFIG_ESP32_PHY_INIT_DATA_IN_PARTITION is not set
CONFIG_ESP32_PHY_MAX_WIFI_TX_POWER=20
CONFIG_ESP32_PHY_MAX_TX_POWER=20
# CONFIG_REDUCE_PHY_TX_POWER is not set
# CONFIG_ESP32_REDUCE_PHY_TX_POWER is not set
CONFIG_ESP_SYSTEM_PM_POWER_DOWN_CPU=y
CONFIG_SYSTEM_EVENT_QUEUE_SIZE=32
CONFIG_SYSTEM_EVENT_TASK_STACK_SIZE=2304
CONFIG_MAIN_TASK_STACK_SIZE=3584
CONFIG_CONSOLE_UART_DEFAULT=y
# CONFIG_CONSOLE_UART_CUSTOM is not set
# CONFIG_CONSOLE_UART_NONE is not set
# CONFIG_ESP_CONSOLE_UART_NONE is not set
CONFIG_CONSOLE_UART=y
CONFIG_CONSOLE_UART_NUM=0
CONFIG_CONSOLE_UART_BAUDRATE=115200
CONFIG_INT_WDT=y
CONFIG_INT_WDT_TIMEOUT_MS=300
CONFIG_TASK_WDT=y
CONFIG_ESP_TASK_WDT=y
# CONFIG_TASK_WDT_PANIC is not set
CONFIG_TASK_WDT_TIMEOUT_S=5
CONFIG_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
# CONFIG_ESP32_DEBUG_STUBS_ENABLE is not set
CONFIG_IPC_TASK_STACK_SIZE=1024
CONFIG_TIMER_TASK_STACK_SIZE=3584
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# CONFIG_ESP32_WIFI_STATIC_TX_BUFFER is not set
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32
# CONFIG_ESP32_WIFI_CSI_ENABLED is not set
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_TX_BA_WIN=6
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_RX_BA_WIN=6
CONFIG_ESP32_WIFI_NVS_ENABLED=y
CONFIG_ESP32_WIFI_SOFTAP_BEACON_MAX_LEN=752
CONFIG_ESP32_WIFI_MGMT_SBUF_NUM=32
CONFIG_ESP32_WIFI_IRAM_OPT=y
CONFIG_ESP32_WIFI_RX_IRAM_OPT=y
CONFIG_ESP32_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP32_WIFI_ENABLE_WPA3_OWE_STA=y
CONFIG_WPA_MBEDTLS_CRYPTO=y
CONFIG_WPA_MBEDTLS_TLS_CLIENT=y
# CONFIG_WPA_WAPI_PSK is not set
# CONFIG_WPA_SUITE_B_192 is not set
# CONFIG_WPA_11KV_SUPPORT is not set
# CONFIG_WPA_MBO_SUPPORT is not set
# CONFIG_WPA_DPP_SUPPORT is not set
# CONFIG_WPA_11R_SUPPORT is not set
# CONFIG_WPA_WPS_SOFTAP_REGISTRAR is not set
# CONFIG_WPA_WPS_STRICT is not set
# CONFIG_WPA_DEBUG_PRINT is not set
# CONFIG_WPA_TESTING_OPTIONS is not set
# CONFIG_ESP32_ENABLE_COREDUMP_TO_FLASH is not set
# CONFIG_ESP32_ENABLE_COREDUMP_TO_UART is not set
CONFIG_ESP32_ENABLE_COREDUMP_TO_NONE=y
CONFIG_TIMER_TASK_PRIORITY=1
CONFIG_TIMER_TASK_STACK_DEPTH=2048
CONFIG_TIMER_QUEUE_LENGTH=10
# CONFIG_ENABLE_STATIC_TASK_CLEAN_UP_HOOK is not set
# CONFIG_HAL_ASSERTION_SILIENT is not set
# CONFIG_L2_TO_L3_COPY is not set
CONFIG_ESP_GRATUITOUS_ARP=y
CONFIG_GARP_TMR_INTERVAL=60
CONFIG_TCPIP_RECVMBOX_SIZE=32
CONFIG_TCP_MAXRTX=12
CONFIG_TCP_SYNMAXRTX=12
CONFIG_TCP_MSS=1440
CONFIG_TCP_MSL=60000
CONFIG_TCP_SND_BUF_DEFAULT=5760
CONFIG_TCP_WND_DEFAULT=5760
CONFIG_TCP_RECVMBOX_SIZE=6
CONFIG_TCP_QUEUE_OOSEQ=y
CONFIG_TCP_OVERSIZE_MSS=y
# CONFIG_TCP_OVERSIZE_QUARTER_MSS is not set
# CONFIG_TCP_OVERSIZE_DISABLE is not set
CONFIG_UDP_RECVMBOX_SIZE=6
CONFIG_TCPIP_TASK_STACK_SIZE=3072
CONFIG_TCPIP_TASK_AFFINITY_NO_AFFINITY=y
# CONFIG_TCPIP_TASK_AFFINITY_CPU0 is not set
CONFIG_TCPIP_TASK_AFFINITY=0x7FFFFFFF
# CONFIG_PPP_SUPPORT is not set
CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_LF is not set
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_CR is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_CRLF is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_LF is not set
CONFIG_NEWLIB_STDIN_LINE_ENDING_CR=y
# CONFIG_NEWLIB_NANO_FORMAT is not set
CONFIG_NEWLIB_TIME_SYSCALL_USE_RTC_HRT=y
# CONFIG_NEWLIB_TIME_SYSCALL_USE_RTC is not set
# CONFIG_NEWLIB_TIME_SYSCALL_USE_HRT is not set
# CONFIG_NEWLIB_TIME_SYSCALL_USE_NONE is not set
CONFIG_ESP32_PTHREAD_TASK_PRIO_DEFAULT=5
CONFIG_ESP32_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
CONFIG_ESP32_PTHREAD_STACK_MIN=768
CONFIG_ESP32_PTHREAD_TASK_CORE_DEFAULT=-1
CONFIG_ESP32_PTHREAD_TASK_NAME_DEFAULT="pthread"
CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ABORTS=y
# CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_FAILS is not set
# CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ALLOWED is not set
CONFIG_SUPPRESS_SELECT_DEBUG_OUTPUT=y
CONFIG_SUPPORT_TERMIOS=y
CONFIG_SEMIHOSTFS_MAX_MOUNT_POINTS=1
# End of deprecated options
